#File

# p = open('file', mode='r', buffering=-1, encoding=None,errors=None, newline=None, closefd=True, opener=None)

#mode - режимы, принимает целое число

"""
-----------------------------------------------------------------------------------------------------------------------------------------
|Режим| Описание
-----------------------------------------------------------------------------------------------------------------------------------------
|'r'  |  Только для чтения.
-----------------------------------------------------------------------------------------------------------------------------------------
|'w'  |  Только для записи. Создаст новый файл, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'rb' |  Только для чтения (бинарный).
-----------------------------------------------------------------------------------------------------------------------------------------
|'wb' |  Только для записи (бинарный). Создаст новый файл, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'r+' |  Для чтения и записи.
-----------------------------------------------------------------------------------------------------------------------------------------
|'rb+'|  Для чтения и записи (бинарный).
-----------------------------------------------------------------------------------------------------------------------------------------
|'w+' |  Для чтения и записи. Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'wb+'|  Для чтения и записи (бинарный). Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'a'  |  Откроет для добавления нового содержимого. Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'a+' |  Откроет для добавления нового содержимого. Создаст новый файл для чтения записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|'ab' |  Откроет для добавления нового содержимого (бинарный). Создаст новый файл для записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
|ab+  |  Откроет для добавления нового содержимого (бинарный). Создаст новый файл для чтения записи, если не найдет с указанным именем.
-----------------------------------------------------------------------------------------------------------------------------------------
Стоит обратить внимание, что в Windows стандартной кодировкой является cp1252, а в Linux — utf-08.
"""

# buffering - целое число


# f = open('text.txt', 'r')
# print(f.read(3)) - how many symbols it should show
# print(f.readline(3)) - how many symbols in a line it should show
# print(f.readlines()) - read all lines and save to a list
# for i in f: - the cycle shows all lines in a file!
#     print(i)
# print(*f) - unpackage file.
# f.close()

# f = open('text.txt', 'r')
# # d = 'Hello'
# # g = f.read()
# # if d in g:
# #     print(True)  - another way to compare if the word in file, through True


# f = open('text123.txt', 'w') - "w" - is rewrite the existing file, "a" - is append (means that it will add to the end)
# d = 'Hello world! \nThe end!'
# f.write(d)
# f.close()

# f = open('text.txt', 'r') - function 1
# f.close()


# with open('text.txt', 'r') as f: - the same function as function 1! It will close immediatly
#     # print(f.read())
#     pass
#
# for i in f:   - here is not in the cyrcle, but if it will in the cyrcle it will work!
#     print(i)

"""1. Напишите скрипт, который запрашивает у пользователя логин
и пароль. Напишите соответствующую валидацию и сохраните в
.txt файл. Затем выведите количество "зарегистрированных
пользователей"."""
#
# login = input('Please enter a login: ')
# password = input('Please enter a password: ')
#
# f = open('text_file.txt', "a")
# f.write(login)
# f.write(password)
#
# f.close()
#
#
# read_file = open('text_file.txt', 'r')
# file = read_file.read()
# print(file)
# read_file.close()


"""2. Найдите какой-нибудь .jpg или .png файл, затем попробуйте
открыть его в скрипте."""

# file = open('/Users/admin/Desktop/Система_счичления.jpeg', 'rb')
# print(file.readlines())
# file.stop

"""3. В чем смысл жизни?"""


"""4. Дан диапазон чисел от 48 до 250. Сохраните все числа в .txt
файл, но прежде оберните каждое число в функцию создания
символов."""

file_range = open('file_text1.txt', 'a')
data = range(48, 250)
for i in data:
    file_range.write(str(i)+'\n')
    print(i)

file_range.close()

